РП/src/InformationRegisters/УчетнаяПолитикаОрганизаций/УчетнаяПолитикаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ПлательщикЕН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>CatalogRef.УчетныеПолитикиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьГруппаПлательщикаЕдиногоНалога</name>
    <comment>для перехода с УТ 3.1</comment>
    <type>
      <types>EnumRef.ГруппыПлательщиковЕдиногоНалога</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИнформацияОСтатусеПлательщикаНалогов</name>
    <comment>для перехода с УТ 3.1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИзмененияУчетнойПолитики</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/Enums/СистемыНалогообложения/СистемыНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СистемыНалогообложения</name>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыльИНДС</name>
  </enumValues>
  <enumValues>
    <name>ЕдиныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ЕдиныйНалогИНДС</name>
  </enumValues>
  <enumValues>
    <name>Неплательщик</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ГруппыПлательщиковЕдиногоНалога/ГруппыПлательщиковЕдиногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыПлательщиковЕдиногоНалога</name>
  <comment>Группы плательщиков единого налога</comment>
  <enumValues>
    <name>ПерваяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ВтораяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ТретьяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ТретьяГруппаОсобая</name>
  </enumValues>
  <enumValues>
    <name>ЧетвертаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ПятаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ШестаяГруппа</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/КлассыСчетовРасходов/КлассыСчетовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КлассыСчетовРасходов</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Класс8</name>
  </enumValues>
  <enumValues>
    <name>Класс9</name>
  </enumValues>
  <enumValues>
    <name>Класс8и9</name>
  </enumValues>
</mdclass:Enum>

РП/src/CommonModules/УчетнаяПолитикаПереопределяемый/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////////
// УчетнаяПолитикаПереопределяемый: переопределяемый механизм отвечающий за получение данных учетной политики.
//  
//////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщиеПараметрыУчетнойПолитики

Функция Существует(Организация, Период, ВыводитьСообщениеОбОтсутствииУчетнойПолитики = Ложь, ДокументСсылка = Неопределено) Экспорт

	Возврат Истина;

КонецФункции

//++ НЕ УТ

Функция ПлательщикНалогаНаПрибыль(Организация, Период) Экспорт
	
	Результат = ПолучитьФункциональнуюОпцию("ПлательщикНалогаНаПрибыль", 
		Новый Структура("Организация, Период", Организация, НачалоМесяца(Период)));
	
	Возврат Результат;
	
КонецФункции 


Функция НалогНаПрибыльБезКорректировокФинансовогоРезультата(Организация, Период) Экспорт
	
	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(
		Организация,
		НачалоМесяца(Период));
		
	Если ПараметрыУчетнойПолитики = Неопределено Тогда
		Результат = Ложь;
	Иначе 
		Результат = ПараметрыУчетнойПолитики.НалогНаПрибыльБезКорректировокФинансовогоРезультата;
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции 

Функция ВключатьСуммуДооценокОСВСоставНераспределеннойПрибыли(Организация, Период) Экспорт
	
	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(
		Организация,
		НачалоМесяца(Период));
		
	Если ПараметрыУчетнойПолитики = Неопределено Тогда
		Результат = Ложь;
	Иначе 
		Результат = ПараметрыУчетнойПолитики.ВключатьСуммуДооценокОСВСоставНераспределеннойПрибыли;
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции 

//-- НЕ УТ

Функция СистемаНалогообложения(Организация, Период) Экспорт

	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(Организация, Период);
	СистемаНалогообложения = ПараметрыУчетнойПолитики.СистемаНалогообложения;
	Возврат СистемаНалогообложения;

КонецФункции

Функция СистемаНалогообложенияУказываетсяСТочностьюДоДня(ЭлементУчетнойПолитики) Экспорт
	
	Возврат (ЭлементУчетнойПолитики.СистемаНалогообложения = Перечисления.СистемыНалогообложения.ЕдиныйНалог
		ИЛИ ЭлементУчетнойПолитики.СистемаНалогообложения = Перечисления.СистемыНалогообложения.ЕдиныйНалогИНДС)
		И ЭлементУчетнойПолитики.ГруппаПлательщикаЕдиногоНалога = Перечисления.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая;
	
КонецФункции
	
Процедура ПреобразоватьЗаписьУчетнойПолитикиПередЗаписью(УчетнаяПолитикаЗапись, ИзменениеПериода = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики)
		ИЛИ НЕ СистемаНалогообложенияУказываетсяСТочностьюДоДня(УчетнаяПолитикаЗапись.УчетнаяПолитика) Тогда
		
		УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики = УчетнаяПолитикаЗапись.Период;
		
	Иначе
		
		ПериодСоответствующийДатеИзмененияПолитики = НачалоМесяца(УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики);
		
		Если УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики <> НачалоМесяца(УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики) Тогда
			ПериодСоответствующийДатеИзмененияПолитики = ДобавитьМесяц(ПериодСоответствующийДатеИзмененияПолитики, 1);
		КонецЕсли;				
		
		Если УчетнаяПолитикаЗапись.Период <> ПериодСоответствующийДатеИзмененияПолитики Тогда
			Если ИзменениеПериода Тогда
				УчетнаяПолитикаЗапись.ДатаИзмененияУчетнойПолитики = УчетнаяПолитикаЗапись.Период;
			Иначе
				УчетнаяПолитикаЗапись.Период = ПериодСоответствующийДатеИзмененияПолитики;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ПараметрыУчетнойПолитикиПоНДС

// Параметры учетной политики по НДС

Функция ПлательщикНДС(Организация, Период) Экспорт

	Возврат Справочники.Организации.ПлательщикНДС(Организация, Период);

КонецФункции 



#КонецОбласти

//++ НЕ УТ
#Область ПараметрыУчетнойПолитикиБухучет

Функция ИспользуемыеКлассыСчетовРасходов(Организация, Период) Экспорт

	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(
		Организация,
		НачалоМесяца(Период));
		
	Если ПараметрыУчетнойПолитики = Неопределено Тогда
		Результат = Перечисления.КлассыСчетовРасходов.Класс9;
	Иначе 
		Результат = ПараметрыУчетнойПолитики.ИспользуемыеКлассыСчетовРасходов;
	КонецЕсли; 

	Возврат Результат;

КонецФункции 


#КонецОбласти
//-- НЕ УТ



// Параметры учетной политики по производству

//++ НЕ УТ



//-- НЕ УТ

#КонецОбласти
